---
type: HandRailType
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 7
tags: [revit-api, class]
---

# HandRailType

`Autodesk.Revit.DB.Architecture.HandRailType` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Height | 2013 | `public double Height { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | SupportJustification | 2013 | `public RailSupportJustification SupportJustification { get ; set ; }` |
| Property | SupportLayout | 2013 | `public RailSupportsLayout SupportLayout { get ; set ; }` |
| Property | SupportNumber | 2013 | `public int SupportNumber { get ; set ; }` |
| Property | SupportSpacing | 2013 | `public double SupportSpacing { get ; set ; }` |
| Property | SupportTypeId | 2013 | `public ElementId SupportTypeId { get ; set ; }` |